import 'package:flutter/material.dart';
import 'app.dart';
import 'package:intl/date_symbol_data_local.dart'; // <-- 1. أضف هذا السطر

// يمكنك استيراد أي تهيئة أولية هنا مثل Firebase أو غيرها

void main() async {
  WidgetsFlutterBinding.ensureInitialized();
  // 3. تأكد من تهيئة Flutter قبل أي شيء

  // 4. قم بتهيئة بيانات اللغة العربية
  await initializeDateFormatting('ar', null);
  // أي تهيئة أخرى قبل تشغيل التطبيق
  // مثال: await Firebase.initializeApp();
  // مثال: await setupServiceLocator(); // إذا كنت تستخدم get_it
  runApp(const MyApp());
}



/*


برافو عليك وعاش اوي
يلا نكمل تطبيقنا واكيد انت فاكر كويس ايه الجزئية الي مش عملنها لحد الان ؟
اجابتك صح زر new لم اضغط عليه هنبدا نفعله بقا وتفاصيلها سهلة ان شاء الله المهم يريت نحافظ علي نفس اسلوب الديزين المبدع الي احنا شغاليين عليه
هقلك بالبلدي كده ايه وظيفة الزر ده ؟ من الاخر انا دلوقتي موظف عاوز اعمل دخول او خروج من المكان الي هو check in or out . هدوس علي الزر يظهر ليا ديلوج يخيرني بين in ولا out دخول ولا خروج يعني
وفي الحالتين هيكون نفس الكلام لكل الي جاي مع اختلاف قيمة واحدة فقط بتاعت I  و O دول بس الي هنغير قيمتهم بس لم نيجي لكلام البرمجة
طيب ضغطت علي دخول او خروج هيقوم ياخد اللوكيشن بتاعي ويوديني لصفحة تانية فيها شكل الماب والمكان بتاعي الفعلي وطبعا الماب هنعرضها باريح شكل واسهل طريقة بدون مشاكل
وهيبقي في هناك تحت الماب كده ايقونة او صورة شبة البصمة ببرحتك انت بقا اعملها لم يضغط عليها هيحصل الاكشن الي هشرحه برمجي فيما بعد ويظهر ليا رسالة ديلوج بشكل شيك
تم عمل check in او العكس حسب بقا ولم ادوس ok يرجعني لصفحة الي كنا فيها من البداية بتاعت زر new وطبعا لازم نضمن تحديث البيانات بقا في الصفحة دي لاي عنصر فيما بعض
كده قولتلك بالبلدي نبدا بقا نشرح برمجة واقلك كل شئ تفصيلي .
المفروض الان لم اضغط علي new هيطلع الديلج الي قولنا عليه بشكل محترف كده يخيرني بين حاجتين وهما check in or Check out
[س بشكل محترف زي ما قولتلك
طب انا خلاص روحت الصفحة التانية بقا الطبيعي في اللحظة دي الصفحة الي هتفتح هيكون فيها شكل جوجل ماب بالمكان الي هو في فعليا وخريطة كمان في نفس الصفحة فيه المكان الي هنعمل فحص معاه الي هو من الاخر اللوكيشن بتاع العمل طيب هجيبه منين بقا ؟ هقلك كمان شوية
طبعا احنا عندنا مكاتب كتير في فلاتر ممكن تظهر الماب اختار اسهلهم وابسطهم بالله عليك المهم يبقي جزء كده في الشاشة في مكانه وكده
طيب هنجيب لوكيشن الشركة منين ؟
طبعا هنجيبه من API ده
http://37.27.112.187:7013/TdpSelfServiceWebSrvc-RESTWebService-context-root/rest/V1/UsersTrnInfoVRO1?q=UsersCode=302
  وطبعا انت فاهم بقا ان في اللينك UsersCode بنيجيب قيمته الي هو رقم الموظف اللي مسجل
  هتلاقي بقا في الداتا اللي راجعة الاحداثي الي هنعرضه والي هنقارن بيه بعد كده
  هيكون اسمهم Lat و Lon
  وشكل الداتا هفكرك بيها كالتالي :-
  {
"items": [
{
"UsersCode": 302,
"ReqApprVcnc": 43,
"LastVcncSeq": 42,
"ReqApprLoan": 5,
"LastLoanSeq": 2113,
"ReqApprEndsrv": 1,
"LastEndsrvSeq": 2,
"ReqApprPrOrder": 3,
"ReqApprPrReq": 0,
"ReqApprAsOrder": 3,
"ReqApprAsReq": 6,
"ReqApprCstd": 1,
"ReqApprCstdReq": 0,
"HrSystem": 2,
"MnSystem": 1,
"PuSystem": 1,
"AsSystem": 1,
"CstdSystem": 1,
"TaSystem": 1,
"ReqApprMnEntry": 0,
"ReqApprMnReq": 0,
"ReqApprMnMast": 0,
"Lat": 24.6761487,
"Lon": 46.6926443,
"links": [
{
"rel": "self",
"href": "http://37.27.112.187:7013/TdpSelfServiceWebSrvc-RESTWebService-context-root/rest/V1/UsersTrnInfoVRO1/302",
"name": "UsersTrnInfoVRO1",
"kind": "item"
},
{
"rel": "canonical",
"href": "http://37.27.112.187:7013/TdpSelfServiceWebSrvc-RESTWebService-context-root/rest/V1/UsersTrnInfoVRO1/302",
"name": "UsersTrnInfoVRO1",
"kind": "item"
}
]
}
],
"count": 1,
"hasMore": false,
"limit": 9999,
"offset": 0,
"links": [
{
"rel": "self",
"href": "http://37.27.112.187:7013/TdpSelfServiceWebSrvc-RESTWebService-context-root/rest/V1/UsersTrnInfoVRO1",
"name": "UsersTrnInfoVRO1",
"kind": "collection"
}
]
}

كده انت عارف الخرطتين ايه احدثيتهم يبقي الاولي بتاعت المكان وجاية من API والتانية الموقع الحالي للموظف بقا .
عاوزين يبقي في بقا صورة او ايقونة شبه البصمة كده بحيث لم يضغط عليها هيحصل موضوع IN OR OUT
طب لم يضغط هنعمل ايه
اكيد هنبعت الداتا الي API POST وده اللينك الي هنبعت عليه
http://37.27.112.187:7013/TdpSelfServiceWebSrvc-RESTWebService-context-root/rest/V1/TaEmpSheetDummyVO1
طيب ايه البيانات الي هتروح بالضبط وهنا هقلك الفرق بين IN او OUT
هقلك اسم KEY [الضبط وبعدين القيمة وركز اوي

"EmpCode": رقم الموظف الي مسجل
"CompEmpCode": هتلاقي قيمتها في بيانات الموظف بنفس الاسماء
"AttDate": ده التاريخ الوقتي الفعلي الي بيضغط فيه وهوريك شكل الفورمات بالمثال ده
 "2023-03-14T08:41:28+03:00"
"AttType": هنا بقا لو كان CHECK IN يبقي القيمة "I" اما لو كان cHECK OUT يبقي القيمة "O"
"AttMachine": 1,   ثابت دائما ب 1
"AttTime": هو نفسه قيمة AttDate
"AttDatetime": هو نفسه قيمة AttDate
"AltKey": هنا ركز معايا بقا اوي اوي علشان نعرف نحدد قيمة الKEY ده هيكون كالتالي
EmpCodeوبعدين - وبعدين اليوم وبعدين الشهر وبعدين السنة وبعدين الساعة وبعدين الدقائق
مثال للتوضيح يعني في حالتنا هنا لو رقم الموظف 302 والتوقيت الي سجل فيه زي الي فوق بالضبط هيكون قيمة AltKey كالتالي "789-140320230841"
لو مش واضحة اسئلني بردك
"Lat": طبعا ده احداثيات الشخص الموظف الي بيسجل ,
"Lon": طبعا ده احداثيات الشخص الموظف الي بيسجل ,
دي بس الداتا الي محتاجينها
السؤال هنا هل هعمل Post كده علي طول ولا ايه ؟
طبعا لا في شرط مهم جدا ركز معايا فيه واكيد انت توقعته
هنعمل فحص الاول بين lat lon للموظف والمكان الشركة
لو في نفس الحيز هنقبل يعني مثلا مسموح بمسافة تكاد تكون في حدود 50 متر بينهم اقصي شئ وقتها هو في المكان يبقي نقبل ونبعت الداتا
والكلام في الدخول والخروج
طيب لو مثلا الاحداثيات بتاعت Lat Lon للشركة فاضية اقبل عادي واعمل Post بدون فحص اصلا .
طبعا لو بعيد عن المكان زي ما قولنا لازم اخرج ليه رسالة انه خارج الشركة اصلا
طيب لو تم التسجيل بقا هنرجعه للصفحة الخارجية الي كان فيها زر ال new وطبعا لازم يكون في تحديث لداتا سواء سجل الحضور اوالمتحقق منه
طبعا عاوزك تركز وتعطيني الملفات كاملة
خلي بالك كويس ان الباك اند معمول ب Adf تبع اوراكل فخلي بالك من الترميز وفورمات الوقت
وكمان نوع الداتا الي بتبعته تبقا خاصة باوراكل وكده
يريت تعمل بردك معالجة اخطاء كثيرة علشان مش يحصل اي مشاكل من فضلك
وانت بترد عليا اعطيني الاكواد كاملة لكل ملف هيكون في تعديل او لو كان جديد لازم الكود كاملا لاي تغير او جديد
والموضوع بسيط فخلي الكود كلها في رد واحد من فضلك
وبدون اخطاء ركز في كل كلامي
واعتمد كليا علي الاكواد الي بعته لك قبل كده وكمان اعتمد في ترتيب الملفات علي الي نظام تقسيم الملفات الي عملناه سابقا . لو مش فاكر قولي
لو في حاجة مش واضحة اسئل
ارجوك انا قلقان من قصة عرض map فتاني باكد عليك استخدم ابسط الامور خالص .
والديزين يريتيكون باحتراف ومعتمد علي الوانا التطبيق المستخدمة

 */