Repository: MohanadAbdallah-mv/flutterapppart2hrv2
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: Home
ar: الرئيسية

# loginTitle
source: Login
ar: تسجيل الدخول

# userCodeHint
source: User Code
ar: رقم المستخدم

# passwordHint
source: Password
ar: كلمة المرور

source: Login
ar: دخول

source: Welcome
ar: أهلاً بك

# services
source: Available Services
ar: الخدمات المتاحة

# purchases
source: Purchase
ar: المشتريات

# purchasesO
source: Purchase orders
ar: أوامر الشراء

# purchasesR
source: purchase requisitions
ar: طلبات الشراء

# humanResources
source: My requests
ar: طلباتي

source: Custody
ar: العهد

source: Maintenance
ar: الصيانة

# about
source: About App
ar: حول التطبيق

# myProfile
source: Approval required
ar: الموافقة المطلوبة

source: Logout
ar: تسجيل الخروج

# personalInfo
source: Personal Information
ar: المعلومات الشخصية

# jobInfo
source: Job Information
ar: المعلومات الوظيفية

# financialInfo
source: Financial Information
ar: المعلومات المالية

# vacationInfo
source: Vacation request
ar: طلبات الإجازات

# loanInfo
source: Loan request
ar: طلبات السلف

# resignationInfo
source: Resignation request
ar: طلبات الاستقالة

# attendanceInfo
source: Attendance and departure
ar: الحضور والانصراف

# ticketsInfo
source: Tickets Information
ar: معلومات تذاكر السفر

source: Department
ar: الإدارة

source: Job
ar: الوظيفة

source: Nationality
ar: الجنسية

source: Gender
ar: الجنس

source: Male
ar: ذكر

source: Female
ar: أنثى

# systemTitle
source: Enterprise Resource Management System
ar: نظام إدارة موارد المؤسسة

# systemWelcomeMessage
source: Welcome to the Enterprise Resource Management System
ar: مرحباً بك في نظام إدارة موارد المؤسسة

# loginSuccessMessage
source: Login successful
ar: تم تسجيل الدخول بنجاح

# loginErrorMessage
source: Login failed. Please try again
ar: حدث خطأ في تسجيل الدخول. يرجى المحاولة مرة أخرى

# continueButton
source: Continue
ar: متابعة

source: Forgot Password?
ar: نسيت كلمة المرور؟

# noAccountText
source: Don't have an account?
ar: ليس لديك حساب؟

# signUpText
source: Sign Up
ar: تسجيل جديد

# userCodeValidationError
source: Please enter your user code
ar: يرجى إدخال رقم المستخدم

# passwordValidationError
source: Please enter your password
ar: يرجى إدخال كلمة المرور

# passwordLengthError
source: Password is too short
ar: كلمة المرور قصيرة جداً

source: Profile Details
ar: تفاصيل الملف الشخصي

source: Basic Information
ar: المعلومات الأساسية

# employeeCode
source: Employee Code (Company):
ar: كود الموظف (الشركة):

source: Employee Name:
ar: اسم الموظف:

source: Job Title:
ar: المسمى الوظيفي:

# salaryAndAllowances
source: Salary and Allowances Details
ar: تفاصيل الراتب والبدلات

source: Basic Salary:
ar: الراتب الأساسي:

source: Transportation Allowance:
ar: بدل النقل:

source: Work Nature Allowance:
ar: بدل طبيعة عمل:

source: Food Allowance:
ar: بدل طعام:

source: Extra:
ar: إضافي:

source: Other Allowances:
ar: بدلات أخرى:

source: Other Deductions:
ar: خصومات أخرى:

source: Allowance 1:
ar: بدل 1:

source: Allowance 2:
ar: بدل 2:

source: Allowance 3:
ar: بدل 3:

source: Housing Information
ar: معلومات السكن

source: Housing Allowance Months:
ar: شهور بدل السكن:

source: Housing Allowance Amount:
ar: مبلغ بدل السكن:

# workScheduleAndVacation
source: Work Schedule and Vacation Information
ar: معلومات الدوام والإجازات

source: Normal Working Days:
ar: أيام الدوام العادية:

source: Unauthorized Absence Days:
ar: أيام الغياب غير المسموح بها:

# vacationEvery
source: Vacation Every (Month/Year):
ar: إجازة كل (شهر/سنة):

source: Travel Tickets Information
ar: معلومات تذاكر السفر

source: Tickets Amount:
ar: مبلغ التذاكر:

# ticketsEvery
source: Tickets Every (Month/Year):
ar: تذاكر كل (شهر/سنة):

source: Tickets Type:
ar: نوع التذاكر:

source: Travel City:
ar: مدينة السفر:

source: Airline:
ar: شركة الطيران:

source: Not available
ar: غير متوفر

source: No user data found.
ar: لم يتم العثور على بيانات للمستخدم.

source: Invalid format
ar: تنسيق غير صالح

source: Under Action
ar: قيد الإجراء

source: Not specified
ar: غير محدد

source: Supplier Name
ar: اسم المورد

source: Order Number
ar: رقم الأمر

source: Order Date
ar: تاريخ الأمر

source: Approved
ar: معتمد

source: Rejected
ar: مرفوض

# orderDetailsTitle
source: Order Details
ar: تفاصيل الأمر

# errorLoadingOrder
source: Error loading order details.
ar: خطأ في تحميل تفاصيل الأمر.

source: Approvals
ar: الاعتمادات

source: Items
ar: الأصناف

# orderNumberLabel
source: Order No:
ar: رقم الأمر:

# orderDateLabel
source: Order Date:
ar: تاريخ الأمر:

# supplierNameLabel
source: Supplier Name:
ar: اسم المورد:

source: Total Order Amount:
ar: الإجمالي الكلي للأمر:

source: Calculating total...
ar: جاري حساب الإجمالي...

source: Take Action
ar: اتخاذ قرار

# actionDialogTitle
source: Decision on Purchase Order
ar: اتخاذ قرار بشأن أمر الشراء

# statementLabel
source: Statement (Notes for current action)
ar: البيان (ملاحظات للإجراء الحالي)

# statementHint
source: Enter your notes here (optional)...
ar: أدخل ملاحظاتك هنا (اختياري)...

source: Submitting action...
ar: جاري إرسال الإجراء...

source: Cancel
ar: إلغاء

source: Reject
ar: رفض

source: Approve
ar: اعتماد

# actionErrorIncompleteData
source: Error: Cannot take action, data is incomplete.
ar: خطأ: لا يمكن اتخاذ إجراء، البيانات غير مكتملة.

# waitForAuthDetails
source: Please wait for approval details to load...
ar: الرجاء الانتظار حتى يتم تحميل تفاصيل الاعتماد...

# approvalSuccess
source: Approved successfully.
ar: تم الاعتماد بنجاح.

# rejectionSuccess
source: Rejection registered successfully.
ar: تم تسجيل الرفض بنجاح.

# unexpectedError
source: An unexpected error occurred.
ar: حدث خطأ غير متوقع.

source: Error loading approvals:
ar: خطأ تحميل الاعتمادات:

# noApprovalData
source: No approval data for this order.
ar: لا توجد بيانات اعتماد لهذا الأمر.

# noRegisteredApprovals
source: No registered approvals for this order.
ar: لا توجد اعتمادات مسجلة لهذا الأمر.

source: Approval Chain:
ar: سلسلة الاعتمادات:

# unknownUser
source: Unknown
ar: غير معروف

# dateLabel
source: Date:
ar: التاريخ:

# notesLabel
source: Notes:
ar: الملاحظات:

# authStatusPending
source: Pending
ar: قيد الإجراء

# authStatusApproved
source: Approved
ar: معتمد

# authStatusRejected
source: Rejected
ar: مرفوض

# authStatusUndefined
source: Undefined
ar: غير محددة

source: Error loading services:
ar: خطأ تحميل الخدمات:

# noServiceData
source: No services for this order.
ar: لا توجد خدمات لهذا الأمر.

# noRegisteredServices
source: No registered services for this order.
ar: لا توجد خدمات مسجلة لهذا الأمر.

source: Service
ar: الخدمة

source: Unit
ar: الوحدة

source: Quantity
ar: كمية

source: Cost
ar: تكلفة

source: Tax
ar: ضريبة

source: Total
ar: إجمالي

source: Error loading items:
ar: خطأ تحميل الأصناف:

# noItemData
source: No items for this order.
ar: لا توجد أصناف لهذا الأمر.

# noRegisteredItems
source: No registered items for this order.
ar: لا توجد أصناف مسجلة لهذا الأمر.

source: Item
ar: الصنف

source: Description
ar: الوصف

source: Price
ar: سعر

# purchaseOrdersTitle
source: Purchase Orders
ar: أوامر الشراء

source: Retry
ar: إعادة المحاولة

# noPurchaseOrders
source: No purchase orders currently.
ar: لا توجد أوامر شراء حاليًا.

source: Refresh
ar: تحديث

# vacationRequestsTitle
source: Vacation Requests
ar: طلبات الإجازة

# noVacationRequests
source: No vacation requests at the moment.
ar: لا توجد طلبات إجازة حالياً.

# vacationRequestDetailsTitle
source: Vacation Request Details
ar: تفاصيل طلب الإجازة

# noRequestSelected
source: No request has been selected.
ar: لم يتم تحديد الطلب.

# vacationActionDialogTitle
source: Decision on Vacation Request
ar: اتخاذ قرار بشأن طلب الإجازة

source: An error occurred
ar: حدث خطأ

# requestFor
source: Request for: {employeeName}
ar: طلب لـ: {employeeName}

# vacationTypeLabel
source: Vacation Type:
ar: نوع الإجازة:

# startDateLabel
source: Start Date:
ar: تاريخ البداية:

# endDateLabel
source: End Date:
ar: تاريخ النهاية:

# durationLabel
source: Duration:
ar: المدة:

# daysUnit
source: days
ar: أيام

# noRegisteredApprovalsForRequest
source: No registered approvals for this request.
ar: لا توجد اعتمادات مسجلة لهذا الطلب.

# myVacationRequestsTitle
source: My Vacation Requests
ar: طلبات الإجازة الخاصة بي

source: New Request
ar: طلب جديد

# newVacationRequestTitle
source: New Vacation Request
ar: طلب إجازة جديد

source: Request Data
ar: بيانات الطلب

source: Vacation Type
ar: نوع الإجازة

# vacationTypeAnnual
source: Annual
ar: سنوية

# vacationTypeRegular
source: Regular
ar: عادية

# vacationTypeUnpaid
source: Unpaid
ar: بدون مرتب

source: Vacation Start Date
ar: تاريخ بداية الإجازة

source: Vacation End Date
ar: تاريخ نهاية الإجازة

# durationInDays
source: Duration (days)
ar: المدة (أيام)

source: Notes
ar: الملاحظات

source: Saving...
ar: جاري الحفظ...

source: Save Request
ar: حفظ الطلب

# selectVacationTypeValidation
source: Please select a vacation type
ar: الرجاء اختيار نوع الإجازة

# selectDate
source: Select a date
ar: اختر تاريخ

# selectDateValidation
source: Please select a date
ar: الرجاء اختيار التاريخ

source: Request sent successfully.
ar: تم إرسال الطلب بنجاح.

source: Vacation Request
ar: طلب إجازة

source: From:
ar: من:

source: To:
ar: إلى:

# requestDateLabel
source: Request Date:
ar: تاريخ الطلب:

source: Request Details
ar: تفاصيل الطلب

source: Close
ar: إغلاق

# requestInfo
source: Request Information
ar: معلومات الطلب

source: From Date:
ar: من تاريخ:

source: To Date:
ar: إلى تاريخ:

# loanRequestsTitle
source: Loan Requests
ar: طلبات السلف

# noLoanRequests
source: No loan requests at the moment.
ar: لا توجد طلبات سلف حالياً.

# loanRequestDetailsTitle
source: Loan Request Details
ar: تفاصيل طلب السلفة

# loanActionDialogTitle
source: Decision on Loan Request
ar: اتخاذ قرار بشأن طلب السلفة

# requestForLoan
source: Loan request for: {employeeName}
ar: طلب سلفة لـ: {employeeName}

# loanTypeLabel
source: Loan Type:
ar: نوع السلفة:

# descriptionLabel
source: Description:
ar: الوصف:

# loanStartDateLabel
source: Start Date:
ar: تاريخ البدء:

# myLoanRequestsTitle
source: My Loan Requests
ar: طلبات السلف الخاصة بي

# newLoanRequestTitle
source: New Loan Request
ar: طلب سلفة جديد

source: Loan Type
ar: نوع السلفة

source: Total Loan Amount
ar: إجمالي السلفة

# installmentsCount
source: Number of Installments
ar: عدد الأقساط

source: Installment Value
ar: قيمة القسط

source: Repayment Start Date
ar: تاريخ بداية السداد

# selectLoanTypeValidation
source: Please select a loan type
ar: الرجاء اختيار نوع السلفة

# fieldRequiredValidation
source: This field is required
ar: هذا الحقل مطلوب

source: Loan request sent successfully.
ar: تم إرسال الطلب بنجاح.

source: Loan Request
ar: طلب سلفة

# loanValueLabel
source: Loan Value:
ar: قيمة السلفة:

# installmentValueLabel
source: Installment Value:
ar: قيمة القسط:

# installmentsCountLabel
source: Installments Count:
ar: عدد الأقساط:

# repaymentDateLabel
source: Repayment Date:
ar: تاريخ السداد:

# resignationRequestsTitle
source: Resignation Requests
ar: طلبات الاستقالة

# noResignationRequests
source: No resignation requests at the moment.
ar: لا توجد طلبات استقالة حالياً.

# resignationRequestDetailsTitle
source: Resignation Request Details
ar: تفاصيل طلب الاستقالة

# resignationActionDialogTitle
source: Decision on Resignation Request
ar: اتخاذ قرار بشأن طلب الاستقالة

# requestForResignation
source: Resignation request for: {employeeName}
ar: طلب استقالة لـ: {employeeName}

# serviceEndDateLabel
source: Service End Date:
ar: تاريخ نهاية الخدمة:

# lastWorkDayLabel
source: Last Work Day:
ar: آخر يوم عمل:

# reasonsLabel
source: Reason
ar: السبب

# myResignationRequestsTitle
source: My Resignation Requests
ar: طلبات الاستقالة الخاصة بي

# newResignationRequestTitle
source: New Resignation Request
ar: طلب استقالة جديد

# resignationEndDate
source: Resignation Date (End of Service)
ar: تاريخ نهاية العمل (الاستقالة)

source: Last Work Date
ar: تاريخ آخر يوم عمل

source: Reasons for Leaving
ar: أسباب ترك العمل

source: Resignation Request
ar: طلب استقالة

# resignationDateLabel
source: Resignation Date:
ar: تاريخ الاستقالة:

source: Resignation request sent successfully.
ar: تم إرسال طلب الاستقالة بنجاح.

# attendanceAndDeparture
source: Attendance & Departure
ar: الحضور والإنصراف

# newRecord
source: New
ar: جديد

source: Check In
ar: تسجيل حضور

source: Check Out
ar: تسجيل انصراف

# newRecordDialogTitle
source: New Record
ar: تسجيل جديد

source: OK
ar: موافق

# checkInSuccess
source: Check-in recorded successfully.
ar: تم تسجيل الحضور بنجاح.

# checkOutSuccess
source: Check-out recorded successfully.
ar: تم تسجيل الانصراف بنجاح.

# errorOccurred
source: An Error Occurred
ar: حدث خطأ

source: Attendance Log
ar: سجل الحضور

# viewMonthlyLog
source: View monthly attendance log
ar: عرض سجل الحضور والانصراف الشهري

source: Checked Attendance
ar: الحضور الذي تم التحقق منه

# viewCheckedLog
source: View checked attendance sheet
ar: عرض كشف الحضور بعد المراجعة

# attendanceLogTitle
source: Attendance Log
ar: سجل الحضور

source: No attendance log available.
ar: لا يوجد سجل حضور متاح.

# detailsLinkNotAvailable
source: Details link is not available for this month.
ar: رابط التفاصيل غير متاح لهذا الشهر.

# noDataForThisMonth
source: No attendance data for this month.
ar: لا توجد بيانات حضور لهذا الشهر.

source: No records for this day.
ar: لا توجد سجلات لهذا اليوم.

# checkInLabel
source: In:
ar: دخول:

# checkOutLabel
source: Out:
ar: خروج:

# checkedAttendanceLogTitle
source: Checked Attendance Sheet
ar: كشف الحضور المعتمد

# noCheckedLogAvailable
source: No checked sheets available.
ar: لا يوجد كشوفات معتمدة متاحة.

source: No details for this sheet.
ar: لا توجد تفاصيل لهذا الكشف.

source: Date
ar: التاريخ

source: Day
ar: اليوم

source: Entry
ar: الدخول

source: Exit
ar: الخروج

# delayInMinutes
source: Delay(m)
ar: التأخير(د)

source: Status
ar: الحالة

source: Weekend
ar: نهاية أسبوع

source: Absence
ar: غياب

source: Vacation
ar: إجازة

# permissionInfo
source: Permission Requests
ar: طلبات الأذونات

# noPermissionRequests
source: No permission requests found.
ar: لا توجد طلبات أذونات حالياً.

source: New Permission Request
ar: طلب إذن جديد

source: Permission Request Details
ar: تفاصيل طلب الإذن

# permissionTypeLabel
source: Permission Type
ar: نوع الإذن

# reasonTypeLabel
source: Reason Type
ar: نوع السبب

# permissionDateLabel
source: Permission Date
ar: تاريخ الإذن

# fromTimeLabel
source: From Time
ar: من وقت

# toTimeLabel
source: To Time
ar: إلى وقت

# permissionTimeLabel
source: Time
ar: الوقت

# selectPermissionTypeValidation
source: Please select a permission type
ar: الرجاء اختيار نوع الإذن

# selectReasonTypeValidation
source: Please select a reason type
ar: الرجاء اختيار نوع السبب

# selectPermissionDateValidation
source: Please select a permission date
ar: الرجاء اختيار تاريخ الإذن

# selectFromTimeValidation
source: Please select a start time
ar: الرجاء اختيار وقت البدء

# selectToTimeValidation
source: Please select an end time
ar: الرجاء اختيار وقت الانتهاء

source: Permission request sent successfully.
ar: تم إرسال طلب الإذن بنجاح.

# timeValidationError
source: End time must be after start time.
ar: وقت النهاية يجب أن يكون بعد وقت البداية.

# permissionType1
source: Permission
ar: استئذان

# permissionType2
source: Forgot Check-in
ar: نسيان بصمة حضور

# permissionType3
source: Forgot Check-out
ar: نسيان بصمة انصراف

# permissionType4
source: External Work Mission
ar: مهمة عمل خارجي

# reasonType1
source: Private
ar: خاصة

# reasonType2
source: Emergency
ar: طارئة

# reasonType3
source: Other
ar: اخري

# actionSuccess
source: Action successful
ar: تم الإجراء بنجاح

source: Action failed
ar: فشل تنفيذ الإجراء

source: Notes (Optional)
ar: ملاحظات (اختياري)

source: No data available.
ar: لا توجد بيانات متاحة.

source: Send Request
ar: إرسال الطلب

source: Select Time
ar: اختر الوقت

# resumeWorkInfo
source: Resume Work Requests
ar: طلبات مباشرة العمل

# noResumeWorkRequests
source: No resume work requests found.
ar: لا توجد طلبات مباشرة عمل حالياً.

source: New Resume Work Request
ar: طلب مباشرة عمل جديد

source: Resume Work Request Details
ar: تفاصيل طلب مباشرة العمل

# resumeWorkDate
source: Resumption Date
ar: تاريخ مباشرة العمل

# delayReason
source: Reason for Delay
ar: سبب التأخير

# selectStartDate
source: Please select vacation start date
ar: الرجاء اختيار تاريخ بدء الإجازة

# selectEndDate
source: Please select vacation end date
ar: الرجاء اختيار تاريخ نهاية الإجازة

# selectResumeDate
source: Please select resumption date
ar: الرجاء اختيار تاريخ مباشرة العمل

source: Resume work request sent successfully.
ar: تم إرسال طلب مباشرة العمل بنجاح.

# endDateAfterStartDateError
source: End date must be after start date.
ar: تاريخ النهاية يجب أن يكون بعد تاريخ البدء.

# resumeDateAfterStartDateError
source: Resumption date must be after start date.
ar: تاريخ المباشرة يجب أن يكون بعد تاريخ بدء الإجازة.

# componyCode
source: Company Code
ar: كود الشركة

# dCode
source: organizational structure number
ar: رقم الهيكل الإداري

# resumeWorkActionDialogTitle
source: Decision on Resume Work Request
ar: اتخاذ قرار بشأن مباشرة العمل

# employeeTransferInfo
source: Employee Transfer Requests
ar: طلبات نقل موظف

# noEmployeeTransferRequests
source: No employee transfer requests found.
ar: لا توجد طلبات نقل حالياً.

# newEmployeeTransferRequest
source: New Transfer Request
ar: طلب نقل جديد

# employeeTransferRequestDetails
source: Transfer Request Details
ar: تفاصيل طلب النقل

source: Transfer Date
ar: تاريخ النقل

source: New Company Code
ar: كود الشركة الجديد

# newDCode
source: New Department Code
ar: كود الإدارة الجديد

source: New Manager Code
ar: كود المدير الجديد

# transferNotesAr
source: Transfer Notes (Arabic)
ar: ملاحظات النقل (عربي)

# transferNotesEn
source: Transfer Notes (English)
ar: ملاحظات النقل (إنجليزي)

# selectTransferDate
source: Please select the transfer date
ar: الرجاء اختيار تاريخ النقل

# employeeTransferRequestSentSuccessfully
source: Transfer request sent successfully.
ar: تم إرسال طلب النقل بنجاح.

# numericFieldsError
source: Please enter valid numbers in code fields.
ar: الرجاء إدخال أرقام صحيحة في حقول الأكواد.

# fieldRequired
source: This field is required
ar: هذا الحقل مطلوب

# employeeTransferActionDialogTitle
source: Decision on Transfer Employee Request
ar: اتخاذ قرار بشأن نقل الموظف

source: Select Company
ar: اختر الشركة

source: Select Department
ar: اختر الإدارة

# carMovementInfo
source: Car Movement Requests
ar: طلبات تحريك سيارة

# noCarMovementRequests
source: No car movement requests found.
ar: لا توجد طلبات تحريك سيارة حالياً.

source: New Car Movement Request
ar: طلب تحريك سيارة جديد

source: Car Movement Request Details
ar: تفاصيل طلب تحريك السيارة

# carNoLabel
source: Car Number
ar: رقم السيارة

# selectCarNoValidation
source: Please enter the car number
ar: الرجاء إدخال رقم السيارة

source: Car movement request sent successfully.
ar: تم إرسال طلب تحريك السيارة بنجاح.

# carMovementTimeLabel
source: Movement Time
ar: وقت التحرك

# carMovementDateLabel
source: Movement Date
ar: تاريخ التحرك

# selectCarMovementDateValidation
source: Please select the movement date
ar: الرجاء اختيار تاريخ التحرك

# carMovementActionDialogTitle
source: Decision on Car Movement Request
ar: اتخاذ قرار بشأن تحريك سيارة

# salaryConfirmationInfo
source: Salary Confirmation Requests
ar: طلبات تثبيت راتب

# noSalaryConfirmationRequests
source: No salary confirmation requests found.
ar: لا توجد طلبات تثبيت راتب حالياً.

source: New Salary Confirmation Request
ar: طلب تثبيت راتب جديد

source: Salary Confirmation Request Details
ar: تفاصيل طلب تثبيت الراتب

# dCodeHint
source: Organizational Structure Code
ar: رقم الهيكل الإداري

# selectRequestDate
source: Please select the request date
ar: الرجاء اختيار تاريخ الطلب

# selectDCodeValidation
source: Please enter the organizational structure code
ar: الرجاء إدخال رقم الهيكل الإداري

source: Salary confirmation request sent successfully.
ar: تم إرسال طلب تثبيت الراتب بنجاح.

# salaryConfirmationActionDialogTitle
source: Decision on Salary Confirmation Request
ar: اتخاذ قرار بشأن تثبيت الراتب

# cancelSalaryConfirmationInfo
source: Cancel Salary Confirmation Requests
ar: طلبات إلغاء تثبيت راتب

# noCancelSalaryConfirmationRequests
source: No cancel salary confirmation requests found.
ar: لا توجد طلبات إلغاء تثبيت راتب حالياً.

source: New Cancel Salary Confirmation Request
ar: طلب إلغاء تثبيت راتب جديد

source: Cancel Salary Confirmation Request Details
ar: تفاصيل طلب إلغاء تثبيت الراتب

source: Cancel salary confirmation request sent successfully.
ar: تم إرسال طلب إلغاء تثبيت الراتب بنجاح.

# cancelSalaryConfirmationActionDialogTitle
source: Decision on Cancel Salary Confirmation
ar: اتخاذ قرار بشأن إلغاء تثبيت الراتب
